// Версия игры v 3.0.1
// Переделана на модули
// сделай следующее:
// todo: +++ Сделай разбивку игры на 2 фазы, выставление отрядов и игра.
// todo: +++ Для каждой стадии своя функция на столкновение,
//  в бою отряды не должны отскакивать
// todo: +++ Сделай опцию поворота отряда на 90 градусов

// todo: Есть 2 массива с двух отрядов если они равны то одна функция составления пар
//  если нет то другая, так чтобы последний в меньшем отряде дрался против двух соответственно
// todo: Попробовать сделать удаление/добавление юнита на текущую позицию
// todo: описание столкновения и начала боя у отрядов
// todo: Начни описывать методы боя.
// todo: только после того как напишешь бой
// todo: Выдача денег игроку
// todo: в любом порядке пользователь добавляет отряды себе,
//       компу пишем отдельно сразу.
// todo: стоимости для солдафонов, возьми ЛБХ солдатиков
// todo: Добавить кнопку удаления юнита из отряда
// todo: попробуй запускать чекколлизион через троттл.
//       чтобы не вызывать её так часто, мб плавнее всё будет работать
// todo: Апгрейди мини карту